import requests
import math
from lxml import html
import random
import logging
import sys
import uuid
import json
import time
import pandas as pd
from utility.toolkit import ToolKit

logging.basicConfig(
    stream=sys.stdout,
    level=logging.INFO,
    format="%(asctime)s - %(levelname)s - %(message)s",
)
logger = logging.getLogger(__name__)

# https://www.useragents.me/#most-common-desktop-useragents-json-csv 获取最新user agent
user_agent_list = [
    "Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/127.0.0.0 Safari/537.3",
    "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/128.0.0.0 Safari/537.3",
    "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/127.0.0.0 Safari/537.3",
    "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/128.0.0.0 Safari/537.36 Edg/128.0.0.",
    "Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:129.0) Gecko/20100101 Firefox/129.",
    "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/126.0.0.0 Safari/537.36 Edg/126.0.0.",
    "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/126.0.0.0 Safari/537.36 OPR/112.0.0.",
    "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/127.0.0.0 Safari/537.36 Edg/127.0.0.",
    "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/124.0.0.0 Safari/537.36 Edg/124.0.0.",
    "Mozilla/5.0 (X11; Linux x86_64; rv:109.0) Gecko/20100101 Firefox/113.",
    "Mozilla/5.0 (X11; Ubuntu; Linux x86_64; rv:129.0) Gecko/20100101 Firefox/129.",
    "Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/128.0.0.0 Safari/537.3",
    "Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/109.0.0.0 Safari/537.36 Edg/109.0.1518.14"
    "Mozilla/5.0 (Windows NT 6.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/109.0.0.0 Safari/537.36 Edg/109.0.1518.10",
    "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/121.0.0.0 Safari/537.3",
    "Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/129.0.0.0 Safari/537.36",
]

headers = {
    "User-Agent": random.choice(user_agent_list),
    "Referer": "sh.ke.com",
    "Host": "sh.ke.com",
    "Connection": "keep-alive",
    "Accept": "text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7",
    "Accept-encoding": "gzip, deflate, br, zstd",
    "Accept-language": "zh-CN,zh;q=0.9",
    "Cookie": ("ke_uuid=%s;") % (uuid.uuid4()),
}


def check_proxy_anonymity(url, headers, proxy):
    try:
        s = requests.Session()
        s.proxies = proxy
        s.headers.update(headers)
        response = s.get(url, timeout=3)
        if response.status_code == 200:
            tree = html.fromstring(response.content)
            div = tree.xpath(
                '//div[@class="xiaoquListPage"]/div[@class="content"]/div[@class="leftContent"]/div[@class="resultDes clear"]/h2[@class="total fl"]/span'
            )
            if div:
                cnt = div[0].text_content().strip()
                page_no = math.ceil(int(cnt) / 30)
                print("当前获取房源量为%s,总页数为%s" % (cnt, page_no))
                print("proxy %s有效" % (proxy))
                return True
            else:
                print("proxy无效")
                return False
        else:
            print(f"Failed to retrieve data: {response.status_code}")
            return False

    except requests.exceptions.RequestException as e:
        print(f"{proxy}: {e}")
        return False
    except Exception as e:
        print(f"发生了未知错误: {e}")
        return False


# ZDY: https://api.openproxylist.xyz/http.txt
def get_proxies_listv1(url):
    proxy_url = "https://api.openproxylist.xyz/http.txt"
    count = 0
    dlist = []
    target = 1
    while count < target:
        s = requests.session()
        response = s.get(proxy_url, timeout=3)
        if response.status_code == 200:
            proxy_list = [
                "http://" + proxy
                for proxy in response.content.decode("utf-8").strip().split("\n")
            ]
            for item in proxy_list:
                proxy = {"https": item, "http": item}
                # proxy = {"https": item}
                if check_proxy_anonymity(url, headers, proxy):
                    dlist.append(item)
                    count = count + 1
                if count == target:
                    break
            break
        else:
            print("proxy get failed..")
            break
    print(dlist)


# https://getproxy.bzpl.tech/get/
def get_proxies_listv2(url):
    proxy_url = "https://getproxy.bzpl.tech/get/"
    count = 0
    dlist = []
    target = 1
    while count < target:
        s = requests.session()
        time.sleep(random.randint(1, 3))  # 随机休眠
        response = s.get(proxy_url, timeout=3)
        if response.status_code == 200:
            json_str = response.content.decode("utf-8")
            json_data = json.loads(json_str)
            proxy = {
                "https": "http://" + json_data["proxy"],
                "http": "http://" + json_data["proxy"],
            }
            if check_proxy_anonymity(url, headers, proxy):
                dlist.append("http://" + json_data["proxy"])
                count = count + 1
    print(dlist)


# 使用示例
# proxyscrape.com免费proxy: https://api.proxyscrape.com/v3/free-proxy-list/get?request=displayproxies&country=cn&protocol=http&proxy_format=protocolipport&format=text&anonymity=Elite,Anonymous&timeout=3000
# 站大爷免费proxy: https://www.zdaye.com/free/?ip=&adr=&checktime=&sleep=3&cunhuo=&dengji=&nadr=&https=1&yys=&post=&px=


def get_proxies_listv3(proxies_list, url):
    dlist = []
    t1 = ToolKit("检验中......")
    df = pd.read_csv("./houseinfo/proxies.csv", names=["proxy"], comment="#")
    pre_proxies = df["proxy"].tolist()
    for idx, item in enumerate(proxies_list):
        proxy = {"https": item, "http": item}
        if check_proxy_anonymity(url, headers, proxy):
            if item not in pre_proxies:
                print("item: %s" % (item))
                df_result = pd.DataFrame([item])
                df_result.to_csv(
                    "./houseinfo/proxies.csv", mode="a", header=False, index=False
                )
                pre_proxies.append(item)
                dlist.append(item)
        t1.progress_bar(len(proxies_list), idx)

    print(dlist)


# url = "http://sh.lianjia.com/xiaoqu/xuhui/pgpgnobp0ep100/"
url = "http://sh.ke.com/xiaoqu/xuhui/pg1cro21/"
proxies_list = [
    "http://91.107.163.2:3128",
    "http://51.159.159.73:80",
    "http://51.81.46.174:3128",
    "http://31.207.47.56:8118",
    "http://165.155.229.9:9480",
    "http://165.155.229.12:9400",
    "http://165.155.230.12:9480",
    "http://165.155.230.12:9400",
    "http://165.155.229.9:9400",
    "http://165.155.228.8:9480",
    "http://165.155.228.10:9400",
    "http://165.155.230.9:9400",
    "http://165.155.228.8:9400",
    "http://165.155.229.13:9480",
    "http://165.155.230.8:9400",
    "http://165.155.228.18:9400",
    "http://165.155.228.16:9400",
    "http://165.155.229.11:9480",
    "http://165.155.228.9:9480",
    "http://165.155.228.9:9400",
    "http://165.155.230.13:9480",
    "http://165.155.230.13:9400",
    "http://165.155.230.10:9400",
    "http://165.155.228.16:9480",
    "http://165.155.228.14:9400",
    "http://165.155.228.19:9480",
    "http://165.155.229.8:9400",
    "http://165.155.228.17:9480",
    "http://165.155.230.11:9480",
    "http://165.155.229.10:9480",
    "http://165.155.228.13:9480",
    "http://165.155.228.12:9480",
    "http://165.155.228.17:9400",
    "http://165.155.228.19:9400",
    "http://165.155.230.11:9400",
    "http://165.155.228.11:9480",
    "http://165.155.230.10:9480",
    "http://185.253.32.26:8080",
    "http://165.155.230.8:9480",
    "http://72.10.160.90:1493",
    "http://165.155.228.18:9480",
    "http://188.132.221.81:8080",
    "http://165.155.229.11:9400",
    "http://192.99.169.19:8447",
    "http://165.155.228.10:9480",
    "http://165.155.229.13:9400",
    "http://41.128.90.53:1976",
    "http://162.210.192.171:15010",
    "http://165.155.228.11:9400",
    "http://20.163.56.142:10000",
    "http://20.204.214.23:3129",
    "http://20.204.212.76:3129",
    "http://198.24.188.142:54793",
    "http://67.43.236.20:11745",
    "http://31.133.0.163:33033",
    "http://165.155.228.14:9480",
    "http://165.155.229.10:9400",
    "http://72.10.164.178:6893",
    "http://45.119.133.218:3128",
    "http://178.34.190.6:8080",
    "http://165.155.229.8:9480",
    "http://67.43.236.18:27239",
    "http://72.10.164.178:20235",
    "http://128.199.254.13:9090",
    "http://67.43.228.253:2743",
    "http://43.156.240.241:59394",
    "http://128.199.121.61:9090",
    "http://152.42.186.41:9090",
    "http://152.42.170.187:9090",
    "http://67.43.236.19:18847",
    "http://146.190.80.158:9090",
    "http://45.150.26.170:8080",
    "http://18.171.205.196:10063",
    "http://45.175.237.152:999",
    "http://218.60.0.220:80",
    "http://67.43.228.253:2585",
    "http://128.199.118.49:9090",
    "http://41.254.48.66:1981",
    "http://93.188.82.142:3128",
    "http://101.255.148.22:3127",
    "http://8.153.12.119:3128",
    "http://20.44.188.17:3129",
    "http://72.10.160.173:19851",
    "http://160.86.242.23:8080",
    "http://20.44.189.184:3129",
    "http://189.125.109.66:3128",
    "http://94.247.129.244:3128",
    "http://35.73.28.87:3128",
    "http://67.43.236.20:19243",
    "http://43.133.59.220:3128",
    "http://72.10.160.171:17121",
    "http://128.199.253.195:9090",
    "http://34.176.200.170:3128",
    "http://200.10.30.217:8083",
    "http://43.134.33.254:3128",
    "http://165.155.228.13:9400",
    "http://72.10.164.178:24539",
    "http://72.10.160.90:16611",
    "http://67.43.228.253:17149",
    "http://154.55.228.117:3128",
    "http://67.43.236.20:5633",
    "http://34.97.57.4:8561",
    "http://34.97.67.132:8561",
    "http://34.97.45.196:8561",
    "http://41.65.251.87:1981",
    "http://165.155.228.15:9480",
    "http://67.43.236.20:17133",
    "http://67.43.228.253:1553",
    "http://34.97.65.59:8561",
    "http://152.70.235.185:9002",
    "http://34.97.61.13:8561",
    "http://72.10.164.178:28087",
    "http://177.139.195.10:3128",
    "http://67.43.236.20:4319",
    "http://88.248.113.25:3310",
    "http://34.97.27.41:8561",
    "http://72.10.160.91:25591",
    "http://72.10.160.93:8395",
    "http://72.10.160.90:15621",
    "http://67.43.227.227:18775",
    "http://34.97.42.111:8561",
    "http://72.10.164.178:31363",
    "http://209.159.153.20:61839",
    "http://72.10.164.178:17577",
    "http://194.5.25.34:443",
    "http://67.43.227.227:20697",
    "http://72.10.164.178:3995",
    "http://67.43.227.227:4375",
    "http://18.163.122.172:3128",
    "http://80.240.55.246:3128",
    "http://72.10.160.90:13537",
    "http://72.10.160.94:25601",
    "http://67.43.227.227:31971",
    "http://72.10.160.90:29075",
    "http://34.97.229.206:8561",
    "http://121.40.62.167:3128",
    "http://67.43.236.18:28553",
    "http://67.43.227.228:1853",
    "http://67.43.228.250:29843",
    "http://34.97.138.39:8561",
    "http://67.43.227.228:17089",
    "http://194.4.57.152:3128",
    "http://147.75.92.251:9443",
    "http://67.43.227.227:11549",
    "http://67.43.236.20:8381",
    "http://67.43.236.20:18929",
    "http://67.43.227.227:17089",
    "http://67.43.236.21:14373",
    "http://147.75.92.244:9443",
    "http://72.10.164.178:16999",
    "http://72.10.164.178:8489",
    "http://144.86.187.61:3129",
    "http://108.181.133.58:11112",
    "http://190.92.151.66:9021",
    "http://72.10.160.90:25069",
    "http://72.10.160.173:11829",
    "http://67.43.227.228:18349",
    "http://5.161.219.13:4228",
    "http://67.43.236.18:6715",
    "http://67.43.227.229:1853",
    "http://154.23.22.83:3128",
    "http://67.43.227.227:20871",
    "http://72.10.160.93:31071",
    "http://72.10.160.91:9317",
    "http://80.91.116.129:8081",
    "http://72.10.160.171:12409",
    "http://72.10.160.173:2123",
    "http://67.43.236.20:8397",
    "http://67.43.236.20:22405",
    "http://147.28.155.21:9443",
    "http://116.68.170.115:8019",
    "http://72.10.160.170:16937",
    "http://67.43.236.21:31517",
    "http://72.10.164.178:1155",
    "http://72.10.160.170:13855",
    "http://72.10.160.170:11321",
    "http://72.10.164.178:3597",
    "http://35.177.161.93:33333",
    "http://67.43.227.227:21149",
    "http://72.10.160.170:8929",
    "http://67.43.227.227:33069",
    "http://67.43.236.20:4311",
    "http://203.150.113.90:8080",
    "http://154.90.48.21:9090",
    "http://67.43.227.227:25371",
    "http://177.12.107.167:443",
    "http://67.43.227.227:25353",
    "http://78.188.230.238:3310",
    "http://67.43.228.253:13305",
    "http://67.43.228.254:31721",
    "http://178.48.68.61:18080",
    "http://67.43.236.20:5657",
    "http://186.215.87.194:30006",
    "http://111.89.146.127:3128",
    "http://67.43.227.229:4905",
    "http://160.248.7.207:3128",
    "http://67.43.236.21:25413",
    "http://72.10.164.178:3799",
    "http://190.94.212.43:999",
    "http://179.49.117.19:999",
    "http://128.199.187.46:9090",
    "http://72.10.160.171:18535",
    "http://67.43.227.227:6459",
    "http://103.18.77.50:1111",
    "http://72.10.164.178:1207",
    "http://103.191.218.255:8087",
    "http://67.43.236.20:20725",
    "http://72.10.164.178:10389",
    "http://67.43.227.226:30917",
    "http://67.43.236.20:8119",
    "http://34.97.31.37:8561",
    "http://67.43.236.20:6549",
    "http://112.19.241.37:19999",
    "http://152.42.170.225:9090",
    "http://82.129.154.218:1981",
    "http://72.10.164.178:8787",
    "http://72.10.160.90:22149",
    "http://72.10.164.178:5451",
    "http://144.86.187.40:3129",
    "http://72.10.164.178:19507",
    "http://38.7.1.185:999",
    "http://38.99.101.101:3128",
    "http://5.58.25.124:8080",
    "http://102.68.128.211:8080",
    "http://72.10.164.178:10259",
    "http://67.43.227.226:9753",
    "http://201.77.48.147:8080",
    "http://67.43.236.20:18805",
    "http://67.43.227.226:17493",
    "http://45.71.114.147:999",
    "http://67.43.228.253:7277",
    "http://67.43.228.253:28469",
    "http://45.173.7.10:999",
    "http://82.129.233.3:1976",
    "http://67.43.227.227:7149",
    "http://185.208.102.58:8080",
    "http://67.43.227.228:28023",
    "http://77.242.98.39:8080",
    "http://77.242.30.9:8088",
    "http://200.63.107.118:8089",
    "http://67.43.236.18:25757",
    "http://103.215.187.66:8080",
    "http://1.2.252.65:8080",
    "http://67.43.228.252:4101",
    "http://80.28.205.39:3128",
    "http://54.212.22.168:80",
    "http://142.171.157.207:3128",
    "http://67.43.227.226:7795",
    "http://67.43.227.230:20581",
    "http://72.10.160.91:32987",
    "http://72.10.164.178:8911",
    "http://94.182.40.51:3128",
    "http://185.200.38.140:8080",
    "http://67.43.228.253:15007",
    "http://165.155.230.9:9480",
    "http://72.10.164.178:19225",
    "http://147.28.155.23:9443",
    "http://67.43.228.254:18461",
    "http://14.242.25.180:8080",
    "http://221.122.91.36:9480",
    "http://103.143.168.58:84",
    "http://38.156.73.61:8080",
    "http://125.26.4.219:8080",
    "http://67.43.228.251:1349",
    "http://148.101.179.182:8080",
    "http://41.128.90.53:1981",
    "http://102.38.31.8:80",
    "http://182.252.70.220:8082",
    "http://92.60.190.79:3128",
    "http://45.188.167.25:999",
    "http://67.43.236.20:22331",
    "http://103.181.168.218:8080",
    "http://165.155.229.12:9480",
    "http://161.34.35.226:3128",
    "http://190.97.94.20:999",
    "http://67.43.227.226:6755",
    "http://79.106.33.26:8079",
    "http://67.43.228.254:1349",
    "http://201.77.108.160:999",
    "http://213.97.158.42:3128",
    "http://170.80.242.78:999",
    "http://34.97.58.253:8561",
    "http://103.48.69.33:83",
    "http://103.159.194.171:3128",
    "http://67.43.227.227:1793",
    "http://201.234.186.234:999",
    "http://103.141.20.158:8181",
    "http://190.239.220.94:999",
    "http://161.34.68.133:3128",
    "http://12.7.109.1:9812",
    "http://67.43.236.20:8171",
    "http://36.88.253.86:8080",
    "http://144.86.187.34:3129",
    "http://181.115.66.234:999",
    "http://101.251.204.174:8080",
    "http://103.168.169.245:80",
    "http://67.43.227.228:5965",
    "http://38.156.73.59:8080",
    "http://176.105.220.74:3129",
    "http://67.43.228.253:27073",
    "http://72.10.164.178:5425",
    "http://181.78.11.234:999",
    "http://38.52.222.246:999",
    "http://67.43.236.21:28553",
    "http://45.177.179.65:999",
    "http://67.43.236.20:32753",
    "http://103.164.223.53:8080",
    "http://72.10.160.172:25581",
    "http://121.239.40.158:8081",
    "http://183.242.69.118:3218",
    "http://45.230.51.130:999",
    "http://103.167.170.210:7777",
    "http://201.238.248.135:8118",
    "http://200.251.41.61:8002",
    "http://156.200.123.170:8080",
    "http://72.10.160.174:26131",
    "http://186.86.143.161:999",
    "http://72.10.160.90:11607",
    "http://72.10.160.170:2549",
    "http://103.217.216.12:1111",
    "http://128.199.187.36:9090",
    "http://180.190.200.77:8082",
    "http://72.10.160.173:25207",
    "http://154.90.49.193:80",
    "http://157.119.211.133:8080",
    "http://67.43.227.227:29389",
    "http://103.156.248.45:8080",
    "http://67.43.227.226:10209",
    "http://103.162.55.2:18080",
    "http://72.10.164.178:25411",
    "http://72.10.160.90:17301",
    "http://72.10.160.171:14447",
    "http://103.90.67.35:8080",
    "http://177.93.33.122:999",
    "http://101.128.93.144:8090",
    "http://120.28.76.192:8082",
    "http://72.10.160.90:28043",
    "http://67.43.236.20:2113",
    "http://83.148.75.16:3128",
    "http://161.34.36.13:3128",
    "http://79.175.138.142:3128",
    "http://103.112.45.46:8080",
    "http://37.98.223.213:8080",
    "http://67.43.227.227:30917",
    "http://144.86.187.43:3129",
    "http://116.80.82.214:3128",
    "http://111.1.61.47:3128",
    "http://72.10.160.90:8053",
    "http://72.10.164.178:11703",
    "http://200.10.28.89:8083",
    "http://51.75.123.179:6017",
    "http://103.145.150.26:8080",
    "http://91.187.113.50:8080",
    "http://188.125.167.67:8080",
    "http://115.127.19.163:9090",
    "http://152.42.178.60:9090",
    "http://161.34.40.113:3128",
    "http://36.50.11.198:8080",
    "http://102.214.167.129:1981",
    "http://143.255.85.180:999",
    "http://31.179.234.41:8080",
    "http://202.154.36.181:8181",
    "http://47.100.192.57:8118",
    "http://187.251.130.156:8080",
    "http://103.179.182.155:8090",
    "http://186.215.87.194:30011",
    "http://103.170.96.64:8090",
    "http://67.43.236.20:29571",
    "http://72.10.160.93:14555",
    "http://67.43.228.253:31515",
    "http://72.10.164.178:16527",
    "http://146.59.16.105:3128",
    "http://129.205.127.30:8080",
    "http://154.73.111.153:1981",
    "http://190.61.40.186:999",
    "http://177.200.80.6:11221",
    "http://161.34.40.111:3128",
    "http://103.125.38.50:8080",
    "http://45.173.123.102:999",
    "http://67.43.228.252:14729",
    "http://193.138.178.246:8282",
    "http://41.111.243.134:80",
    "http://45.122.228.10:8899",
    "http://67.43.236.19:11629",
    "http://67.43.236.20:5921",
    "http://103.70.123.6:8085",
    "http://121.101.133.220:8080",
    "http://201.20.118.146:27234",
    "http://185.237.85.233:8080",
    "http://61.129.2.212:8080",
    "http://155.232.186.42:3128",
    "http://103.168.44.18:8080",
    "http://41.79.33.170:8080",
    "http://85.117.56.85:8080",
    "http://45.182.191.58:8080",
    "http://186.148.181.69:999",
    "http://191.102.248.8:8085",
    "http://170.83.170.2:9191",
    "http://203.177.133.238:8080",
    "http://103.159.96.74:8080",
    "http://38.41.53.145:9090",
    "http://141.94.220.45:3128",
    "http://103.147.247.101:8080",
    "http://161.34.36.157:3128",
    "http://31.27.47.179:8080",
    "http://38.7.1.88:999",
    "http://103.83.18.149:8080",
    "http://4.247.152.147:3128",
    "http://54.212.22.168:3128",
    "http://103.76.149.67:8080",
    "http://92.45.196.83:3310",
    "http://217.24.245.58:8079",
    "http://207.230.8.68:999",
    "http://72.10.160.90:9377",
    "http://190.14.239.58:999",
    "http://195.87.136.2:5331",
    "http://45.186.8.10:9947",
    "http://103.170.131.42:8080",
    "http://150.107.136.205:39843",
    "http://161.34.40.33:3128",
    "http://103.88.113.202:8080",
    "http://154.73.29.33:8080",
    "http://161.34.40.35:3128",
    "http://103.132.53.229:8080",
    "http://111.89.146.125:3128",
    "http://103.175.238.174:8080",
    "http://120.28.189.82:8181",
    "http://121.101.134.214:1111",
    "http://85.118.117.165:8080",
    "http://103.39.50.228:9090",
    "http://45.71.3.51:999",
    "http://118.99.96.174:8080",
    "http://67.43.228.253:15115",
    "http://165.16.30.225:1981",
    "http://45.71.202.148:1993",
    "http://72.10.160.171:20583",
    "http://72.10.160.94:9365",
    "http://110.235.250.77:8080",
    "http://103.180.123.141:1080",
    "http://20.216.12.190:3128",
    "http://103.145.149.36:8080",
    "http://201.174.38.160:999",
    "http://54.212.162.236:3128",
    "http://176.236.232.50:9090",
    "http://185.30.144.222:8080",
    "http://67.43.227.227:8425",
    "http://67.43.236.20:7727",
    "http://181.10.200.154:3128",
    "http://58.69.125.145:8081",
    "http://103.184.180.30:8080",
    "http://148.72.165.7:30118",
    "http://186.125.218.169:999",
    "http://112.78.44.238:1111",
    "http://103.188.175.35:80",
]
get_proxies_listv3(proxies_list, url)
# get_proxies_listv2(url)
# get_proxies_listv1(url)
